#define _CRT_SECURE_NO_WARNINGS
//螺旋方阵
//螺旋方阵是指一个呈螺旋状的矩阵，它的左上角元素为1，由第一行开始按从左到右，从上到下，从从右向左，
//从下到上的顺序递增填充矩阵，直到矩阵填充完毕，下图所示是一个5*5阶的螺旋方阵。输入螺旋方阵的阶数N，按行输出该螺旋方阵。
//输入说明
//输入一个正整数N(1<N <= 100)。
//输出说明
//逐行输出N阶螺旋方阵的元素，元素之间用空格分隔。
//输入样例
//6
//输出样例
//1 2 3 4 5 6
//20 21 22 23 24 7
//19 32 33 34 25 8
//18 31 36 35 26 9
//17 30 29 28 27 10
//16 15 14 13 12 11
//#include <stdio.h>
//int main()
//{
//	int n, i = 0, j = 0;
//	int a[101][101] = { 0 };
//	int k = 1;
//	int num1, num2;//用于计数 
//	int t = 1;//代表方向
//	scanf("%d", &n);
//	num1 = n - 1;//控制大循环 
//	for (j = 0; j<n; j++) //第一行的特殊情况 
//	{
//		a[i][j] = k;
//		k++;
//	}
//	j--;
//	while (num1>0)
//	{
//		num2 = num1;
//		while (num2>0)
//		{
//			i = i + t;
//			a[i][j] = k;
//			k++;
//			num2--;
//		}
//		num2 = num1;
//		t = t*(-1);
//		while (num2>0)
//		{
//			j = j + t;
//			a[i][j] = k;
//			k++;
//			num2--;
//		}
//		num1--;
//	}
//
//	for (i = 0; i<n; i++)
//	{
//		for (j = 0; j<n; j++)
//		{
//			printf("%5d", a[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}

//公式求值
//已知公式Sn=a+aa+aaa+…+aa…a(n个a)，其中a是一个数字（1≤a≤9），n表示a的位数（1≤n≤9），给出两个整数a和n，计算Sn，
//例如：a=2, n=5时Sn=2+22+222+2222+22222。
//输入说明
//在一行上输入两个整数a和n的值，并以空格相隔，1≤a≤9，1≤n≤9。
//输出说明
//输出Sn的计算结果。
//输入样例
//2 5
//输出样例
//24690
//递归
//#include <stdio.h>
//int function(int a, int i)
//{
//	if (i == 1)	return a;
//	else
//	{
//		return function(a, i - 1) * 10 + a;
//	}
//}
//int main()
//{
//	int a = 0;
//	int n = 0;
//	scanf("%d%d", &a, &n);
//	int i = 0;
//	int sum = 0;
//	for (i = 0; i < n; i++)
//	{
//		sum += function(a, i+1);
//	}
//	printf("%d\n", sum);
//	return 0;
//}

//进制转换
//将十进制数转为其他进制数输出。
//输入说明
//输入两个整数，分别表示十进制下的数字a(0≤a≤(2 ^ 31) - 1)和进制N(2≤N≤9)，整数之间使用空格分隔。
//输出说明
//输出十进制数字a的N进制表示。
//输入样例
//17 7
//输出样例
//23
//第一种存在数组中
//#include <stdio.h>
//#include <math.h>
//int main()
//{
//	int a = 0;
//	int n = 0;
//	scanf("%d%d", &a, &n);
//	int i = 0;
//	int arr[100] = { 0 };
//	while (a != 0)
//	{
//		arr[i] = a % n;
//		a /= n;
//		i++;
//	}
//	for (i--; i >= 0; i--)
//	{
//		printf("%d", arr[i]);
//	}
//	return 0;
//}
//第二种方法
//#include <stdio.h>
//#include <math.h>
//int main()
//{
//	int a = 0;
//	int n = 0;
//	scanf("%d%d", &a, &n);
//	int i = 0;
//	int sum = 0;
//	while (a != 0)
//	{
//		sum += (a%n)*pow(10, i);
//		a /= n;
//		i++;
//	}
//	printf("%d\n", sum);
//	return 0;
//}

//上三角矩阵。
//主对角线以下都是零的方阵称为上三角矩阵，给出一个n行n列的方阵，判断是不是上三角矩阵，
//如果是则求出上三角元素和，如果不是则统计下三角非零元素个数。
//输入说明
//输入第一行为一个整数n（1<n<50）表示方阵行数和列数；接下来是n行，每行n个整数，表示方阵的各个元素。
//输出说明
//如果方阵是上三角矩阵，则输出上三角的元素和（不含主对角线上的元素），如果方阵不是上三角矩阵，则输出下三角中非零元素个数（不含主对角线上的元素）。
//输入样例
//输入样例1：
//3
//3 5 5
//0 2 1
//0 0 5
//输入样例2
//3
//3 2 6
//1 0 4
//0 2 1
//输出样例
//输出样例1
//11
//输出样例2
//2
//#include <stdio.h>
//int main()
//{
//	int n = 0;
//	int i = 0;
//	int j = 0;
//	int arr[50][50] = { 0 };
//	scanf("%d", &n);
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//	int flag = 0;//是否为上三角矩阵
//	for(i = 0; i<n; i++)
//	{
//		for (j = 0; j<i; j++)
//		{
//			if (arr[i][j] != 0) flag = 1;
//		}
//	}
//	int sum = 0;
//	if(flag == 0)//是上三角矩阵
//	{
//		for (i = 0; i<n; i++)
//		{
//			for (j = i + 1; j<n; j++)
//			{
//				sum += arr[i][j];
//			}
//		}
//	}
//	else//零的个数
//	{
//		for (i = 0; i<n; i++)
//		{
//			for (j = 0; j<n; j++)
//			{
//				if (arr[i][j] == 0) sum++;
//			}
//		}
//	}
//	printf("%d\n", sum);
//	return 0;
//}
